**PandasExercise**

**DataFrame**

In [7]:
import numpy as np
import pandas as pd

In [24]:
labels = ["a","b","c"]
da = [10,30,50]
arr = np.array(da)
d ={"a":19,"b":4,"c":4}

In [25]:
pd.Series(data= da)# for normal

0    10
1    30
2    50
dtype: int64

In [26]:
pd.Series(data= da,index = labels)# for we want to assign parameters

a    10
b    30
c    50
dtype: int64

In [27]:
pd.Series(da,labels)

a    10
b    30
c    50
dtype: int64

In [28]:
pd.Series(arr)

0    10
1    30
2    50
dtype: int32

In [29]:
pd.Series(d)

a    19
b     4
c     4
dtype: int64

In [30]:
pd.Series(data=labels)

0    a
1    b
2    c
dtype: object

In [42]:
pd.Series(data= [sum,print,len])

0      <built-in function sum>
1    <built-in function print>
2      <built-in function len>
dtype: object

In [43]:
ser1 = pd.Series([1,2,3,4],["U","G","ussa","R"])

In [44]:
ser1

U       1
G       2
ussa    3
R       4
dtype: int64

In [45]:
ser2 = pd.Series([1,2,3,4],["U","G","It","R"])
ser2

U     1
G     2
It    3
R     4
dtype: int64

In [46]:
ser1["R"]

4

In [47]:
ser3 = pd.Series(data = labels)
ser3

0    a
1    b
2    c
dtype: object

In [49]:
ser3[0]

'a'

In [50]:
ser1+ser2# inorder to retain all the information possible  their datatype change in to float64

G       4.0
It      NaN
R       8.0
U       2.0
ussa    NaN
dtype: float64

In [60]:
from numpy.random import randn

In [61]:
np.random.seed(101)

In [62]:
df =pd.DataFrame(randn(5,4),["A","B","C","D","E"],["W","X","Y","Z"])

In [63]:
df

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [64]:
df["W"]

A    2.706850
B    0.651118
C   -2.018168
D    0.188695
E    0.190794
Name: W, dtype: float64

In [67]:
type(df["W"])

pandas.core.series.Series

In [69]:
df[["W","Z"]]

          W         Z
A  2.706850  0.503826
B  0.651118  0.605965
C -2.018168 -0.589001
D  0.188695  0.955057
E  0.190794  0.683509

In [71]:
type(df[["W","Z"]])

pandas.core.frame.DataFrame

In [75]:
df["new"]= df["W"]+df["Y"]

In [76]:
df["new"]

A    3.614819
B   -0.196959
C   -1.489355
D   -0.744542
E    2.796762
Name: new, dtype: float64

In [84]:
 df.drop("new",axis=1,inplace =True)# axis 1 = column and axis = 0 row, for permanalty delete the column put inplace =True

In [85]:
df.loc[["A","B"]]# print all the column value in the row

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965

In [86]:
df

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [87]:
df.drop("E")

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057

In [91]:
df

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057

In [92]:
df.shape

(4, 4)

In [93]:
df.iloc[2]# index number 0,1,2 it means we are using c here

W   -2.018168
X    0.740122
Y    0.528813
Z   -0.589001
Name: C, dtype: float64

In [94]:
df.loc["B","Y"] #row,column

-0.8480769834036315

In [95]:
df.loc[["A","B"],["W","Y"]]

          W         Y
A  2.706850  0.907969
B  0.651118 -0.848077

In [114]:
df.lookup(["A","B"],["W","Y"])

array([ 2.70684984, -0.84807698])

In [102]:
booldf = df>0
booldf

       W      X      Y      Z
A   True   True   True   True
B   True  False  False   True
C  False   True   True  False
D   True  False  False   True

In [110]:
df[df["X"]>0]

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
C -2.018168  0.740122  0.528813 -0.589001

In [109]:
df[df>0]

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118       NaN       NaN  0.605965
C       NaN  0.740122  0.528813       NaN
D  0.188695       NaN       NaN  0.955057

In [116]:
df[df["X"]>0][["W","Y"]]

          W         Y
A  2.706850  0.907969
C -2.018168  0.528813

In [121]:
df[(df["X"]>0)& (df["Y"]>0.5)]

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
C -2.018168  0.740122  0.528813 -0.589001

In [122]:
df.reset_index()

  index         W         X         Y         Z
0     A  2.706850  0.628133  0.907969  0.503826
1     B  0.651118 -0.319318 -0.848077  0.605965
2     C -2.018168  0.740122  0.528813 -0.589001
3     D  0.188695 -0.758872 -0.933237  0.955057

In [126]:
newind ="CA GD JD DK".split()

In [127]:
newind

['CA', 'GD', 'JD', 'DK']

In [128]:
df["new"]= newind

In [129]:
df

          W         X         Y         Z new
A  2.706850  0.628133  0.907969  0.503826  CA
B  0.651118 -0.319318 -0.848077  0.605965  GD
C -2.018168  0.740122  0.528813 -0.589001  JD
D  0.188695 -0.758872 -0.933237  0.955057  DK

In [131]:
df.set_index("new")

            W         X         Y         Z
new
CA   2.706850  0.628133  0.907969  0.503826
GD   0.651118 -0.319318 -0.848077  0.605965
JD  -2.018168  0.740122  0.528813 -0.589001
DK   0.188695 -0.758872 -0.933237  0.955057

In [132]:
#index levels
outside = ["G1","G1","G1","G2","G2","G2"]
inside=[1,2,3,1,2,3]
heir_index = list(zip(outside,inside))
heir_index

[('G1', 1), ('G1', 2), ('G1', 3), ('G2', 1), ('G2', 2), ('G2', 3)]

In [133]:
heir_index = pd.MultiIndex.from_tuples(heir_index)

In [134]:
heir_index

MultiIndex(levels=[['G1', 'G2'], [1, 2, 3]],
           labels=[[0, 0, 0, 1, 1, 1], [0, 1, 2, 0, 1, 2]])

In [140]:
df = pd.DataFrame(randn(6,2),heir_index,["A","B"])
df

             A         B
G1 1 -1.467514 -0.494095
   2 -0.162535  0.485809
   3  0.392489  0.221491
G2 1 -0.855196  1.541990
   2  0.666319 -0.538235
   3 -0.568581  1.407338

In [142]:
df.index.names= ["Groups","Num"]

In [143]:
df

                   A         B
Groups Num
G1     1   -1.467514 -0.494095
       2   -0.162535  0.485809
       3    0.392489  0.221491
G2     1   -0.855196  1.541990
       2    0.666319 -0.538235
       3   -0.568581  1.407338

In [144]:
df.loc ["G2"]

            A         B
Num
1   -0.855196  1.541990
2    0.666319 -0.538235
3   -0.568581  1.407338

In [145]:
df.loc ["G2"].loc[2]

A    0.666319
B   -0.538235
Name: 2, dtype: float64

In [147]:
df.loc ["G2"].loc[2]["B"]

-0.5382346255173922

In [148]:
df.loc["G1",2]["B"]

0.48580873745486103

In [155]:
df.loc ["G2"].loc[3]

A   -0.568581
B    1.407338
Name: 3, dtype: float64

In [151]:
df.xs("G1")

            A         B
Num
1   -1.467514 -0.494095
2   -0.162535  0.485809
3    0.392489  0.221491

In [159]:
df.xs(1,level="Num")

               A         B
Groups
G1     -1.467514 -0.494095
G2     -0.855196  1.541990

**Missingdata**

In [160]:
d = {"A":[1,2,np.nan],"B":[5,np.nan,np.nan],"C":[1,2,3]}

In [162]:
d

{'A': [1, 2, nan], 'B': [5, nan, nan], 'C': [1, 2, 3]}

In [163]:
df = pd.DataFrame(d)

In [164]:
df

     A    B  C
0  1.0  5.0  1
1  2.0  NaN  2
2  NaN  NaN  3

In [170]:
df.dropna(thresh=2,axis=1)

     A  C
0  1.0  1
1  2.0  2
2  NaN  3

In [172]:
df.fillna(value="Fill it")

         A        B  C
0        1        5  1
1        2  Fill it  2
2  Fill it  Fill it  3

In [173]:
df["A"].fillna(value=df["A"].mean())

0    1.0
1    2.0
2    1.5
Name: A, dtype: float64

**pandas Group by**

In [174]:
df =pd.DataFrame(randn(5,4),["A","B","C","D","E"],["W","X","Y","Z"])

In [175]:
df

          W         X         Y         Z
A  0.641806 -0.905100 -0.391157  1.028293
B -1.972605 -0.866885  0.720788 -1.223082
C  1.606780 -1.115710 -1.385379 -1.329660
D  0.041460 -0.411055 -0.771329  0.110477
E -0.804652  0.253548  0.649148  0.358941

In [178]:
df.groupby("W").count()

           X  Y  Z
W
-1.972605  1  1  1
-0.804652  1  1  1
 0.041460  1  1  1
 0.641806  1  1  1
 1.606780  1  1  1

In [179]:
df.groupby("W").sum()

                  X         Y         Z
W
-1.972605 -0.866885  0.720788 -1.223082
-0.804652  0.253548  0.649148  0.358941
 0.041460 -0.411055 -0.771329  0.110477
 0.641806 -0.905100 -0.391157  1.028293
 1.606780 -1.115710 -1.385379 -1.329660

In [186]:
df.groupby("W").describe()

              X                                                        \
          count      mean std       min       25%       50%       75%
W
-1.972605   1.0 -0.866885 NaN -0.866885 -0.866885 -0.866885 -0.866885
-0.804652   1.0  0.253548 NaN  0.253548  0.253548  0.253548  0.253548
 0.041460   1.0 -0.411055 NaN -0.411055 -0.411055 -0.411055 -0.411055
 0.641806   1.0 -0.905100 NaN -0.905100 -0.905100 -0.905100 -0.905100
 1.606780   1.0 -1.115710 NaN -1.115710 -1.115710 -1.115710 -1.115710

                        Y              ...                            Z  \
                max count      mean    ...          75%       max count
W                                      ...
-1.972605 -0.866885   1.0  0.720788    ...     0.720788  0.720788   1.0
-0.804652  0.253548   1.0  0.649148    ...     0.649148  0.649148   1.0
 0.041460 -0.411055   1.0 -0.771329    ...    -0.771329 -0.771329   1.0
 0.641806 -0.905100   1.0 -0.391157    ...    -0.391157 -0.391157   1.0
 1.606780 -1.115710   1.0 -1.385379    ...    -1.385379 -1.385379   1.0


               mean std       min       25%       50%       75%       max
W
-1.972605 -1.223082 NaN -1.223082 -1.223082 -1.223082 -1.223082 -1.223082
-0.804652  0.358941 NaN  0.358941  0.358941  0.358941  0.358941  0.358941
 0.041460  0.110477 NaN  0.110477  0.110477  0.110477  0.110477  0.110477
 0.641806  1.028293 NaN  1.028293  1.028293  1.028293  1.028293  1.028293
 1.606780 -1.329660 NaN -1.329660 -1.329660 -1.329660 -1.329660 -1.329660

[5 rows x 24 columns]

In [184]:
df.groupby("W").describe().transpose()

W        -1.972605  -0.804652   0.041460   0.641806   1.606780
X count   1.000000   1.000000   1.000000   1.000000   1.000000
  mean   -0.866885   0.253548  -0.411055  -0.905100  -1.115710
  std          NaN        NaN        NaN        NaN        NaN
  min    -0.866885   0.253548  -0.411055  -0.905100  -1.115710
  25%    -0.866885   0.253548  -0.411055  -0.905100  -1.115710
  50%    -0.866885   0.253548  -0.411055  -0.905100  -1.115710
  75%    -0.866885   0.253548  -0.411055  -0.905100  -1.115710
  max    -0.866885   0.253548  -0.411055  -0.905100  -1.115710
Y count   1.000000   1.000000   1.000000   1.000000   1.000000
  mean    0.720788   0.649148  -0.771329  -0.391157  -1.385379
  std          NaN        NaN        NaN        NaN        NaN
  min     0.720788   0.649148  -0.771329  -0.391157  -1.385379
  25%     0.720788   0.649148  -0.771329  -0.391157  -1.385379
  50%     0.720788   0.649148  -0.771329  -0.391157  -1.385379
  75%     0.720788   0.649148  -0.771329  -0.391157  -1.385379
  max     0.720788   0.649148  -0.771329  -0.391157  -1.385379
Z count   1.000000   1.000000   1.000000   1.000000   1.000000
  mean   -1.223082   0.358941   0.110477   1.028293  -1.329660
  std          NaN        NaN        NaN        NaN        NaN
  min    -1.223082   0.358941   0.110477   1.028293  -1.329660
  25%    -1.223082   0.358941   0.110477   1.028293  -1.329660
  50%    -1.223082   0.358941   0.110477   1.028293  -1.329660
  75%    -1.223082   0.358941   0.110477   1.028293  -1.329660
  max    -1.223082   0.358941   0.110477   1.028293  -1.329660

In [188]:
d ={"a":19,"b":4,"c":4}
d1 ={"a":1,"b":14,"c":42}
df1 = pd.DataFrame(d,["W","B","C"])

In [189]:
df2 =pd.DataFrame(randn(5,4),["A","B","C","D","E"],["W","X","Y","Z"])

In [193]:
df1.join(df2)

    a  b  c         W         X         Y         Z
A  19  4  4 -1.080471  0.902398  0.161781  0.833029
B  19  4  4  0.975720 -0.388239  0.783316 -0.708954
C  19  4  4  0.586847 -1.621348  0.677535  0.026105

In [194]:
df2.join(df1)

          W         X         Y         Z     a    b    c
A -1.080471  0.902398  0.161781  0.833029  19.0  4.0  4.0
B  0.975720 -0.388239  0.783316 -0.708954  19.0  4.0  4.0
C  0.586847 -1.621348  0.677535  0.026105  19.0  4.0  4.0
D -1.678284  0.333973 -0.532471  2.117727   NaN  NaN  NaN
E  0.197524  2.302987  0.729024 -0.863091   NaN  NaN  NaN

In [197]:
pd.concat([df1,df2],sort = True)

          W         X         Y         Z     a    b    c
A       NaN       NaN       NaN       NaN  19.0  4.0  4.0
B       NaN       NaN       NaN       NaN  19.0  4.0  4.0
C       NaN       NaN       NaN       NaN  19.0  4.0  4.0
A -1.080471  0.902398  0.161781  0.833029   NaN  NaN  NaN
B  0.975720 -0.388239  0.783316 -0.708954   NaN  NaN  NaN
C  0.586847 -1.621348  0.677535  0.026105   NaN  NaN  NaN
D -1.678284  0.333973 -0.532471  2.117727   NaN  NaN  NaN
E  0.197524  2.302987  0.729024 -0.863091   NaN  NaN  NaN

In [199]:
df =pd.DataFrame(randn(5,4),["A","B","C","D","E"],["W","X","Y","Z"])

In [200]:
df

          W         X         Y         Z
A  0.305632  0.243178  0.864165 -1.560931
B -0.251897 -0.578120  0.236996  0.200780
C  0.327845  0.674485 -0.174057  0.780140
D -0.383258 -0.409318  0.343539  0.196275
E -0.982776  2.231555 -0.971393 -1.522333

In [202]:
df.head(3)

          W         X         Y         Z
A  0.305632  0.243178  0.864165 -1.560931
B -0.251897 -0.578120  0.236996  0.200780
C  0.327845  0.674485 -0.174057  0.780140

In [204]:
df["W"].unique()

array([ 0.30563151, -0.25189695,  0.32784474, -0.38325813, -0.982776  ])

In [205]:
df["W"].value_counts()

-0.251897    1
 0.305632    1
 0.327845    1
-0.982776    1
-0.383258    1
Name: W, dtype: int64

In [211]:
df["W"].apply(lambda x: x**2 )

A    0.093411
B    0.063452
C    0.107482
D    0.146887
E    0.965849
Name: W, dtype: float64

In [212]:
df.columns

Index(['W', 'X', 'Y', 'Z'], dtype='object')

In [213]:
df.index

Index(['A', 'B', 'C', 'D', 'E'], dtype='object')

In [214]:
df

          W         X         Y         Z
A  0.305632  0.243178  0.864165 -1.560931
B -0.251897 -0.578120  0.236996  0.200780
C  0.327845  0.674485 -0.174057  0.780140
D -0.383258 -0.409318  0.343539  0.196275
E -0.982776  2.231555 -0.971393 -1.522333

In [216]:
df.sort_values(by ="X")

          W         X         Y         Z
B -0.251897 -0.578120  0.236996  0.200780
D -0.383258 -0.409318  0.343539  0.196275
A  0.305632  0.243178  0.864165 -1.560931
C  0.327845  0.674485 -0.174057  0.780140
E -0.982776  2.231555 -0.971393 -1.522333

In [217]:
df.isnull()

       W      X      Y      Z
A  False  False  False  False
B  False  False  False  False
C  False  False  False  False
D  False  False  False  False
E  False  False  False  False